v2206/atmospheric_AloisLuggerPlatz/test/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version 	2.0;
	format		ascii;
	class 		dictionary;
	location	"system";
	object 		fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// momentumSource
// {
//     type    		meanVelocityForce;
    
//     active  		yes;
    
//     selectionMode   all;
    
//     fields          (U);
    
//     Ubar            (0 0 3);
    
//     relaxation		0.9;
// }
